Revit 2026 API

# BuiltInFailuresMirrorFailures Class

---

Failures about Mirror.

SystemObject Autodesk.Revit.DBBuiltInFailuresMirrorFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MirrorFailures
```
```vb
Public NotInheritable Class MirrorFailures
```
```cpp
public ref class MirrorFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MirrorFailures = class end
```

The BuiltInFailuresMirrorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadMirror | Can't mirror element into this position. |

#### Reference

Autodesk.Revit.DB Namespace